"""
Модуль основной программы
Программист: Казакова Оксана ст. гр. 444
Проверил: 
Дата написания: 08.04.2025
"""

def main():
    db_manager = DataBaseManager('data.csv')

    """ вывод меню и ввода выбранного пункта """

    print()
    print(' МЕНЮ: '.center(50, '*'))
    print('''
        1. Просмотр всей базы данных
        2. Добавление новых записей
        3. Вычисления: средняя масса мальчиков, средний рост девочек, самый высокий ученик
        4. Поиск записи по фамилии и имени
        5. Удаление записи по фамилии и имени
        6. Выход\n
    ''')
    
    num = input('Выберите пункт меню: ')
    while not num.isdigit() or int(num) not in range(1, 7):
        num = input('Повторите выбор пункта меню: ')

    if num == '1':
        db_manager.display_table()

if __name__ == "__main__":
    main()
