"""
Модуль вывода меню и ввода выбранного пункта
Программист: [Твое имя], гр.[номер]
Проверил: [Преподаватель]
Дата написания: 08.04.2025
"""

def menu() -> int:
    """
    Функция вывода меню и ввода выбранного пункта
    """
    print()
    print(' МЕНЮ: '.center(50, '*'))
    print('1. Просмотр всей базы данных')
    print('2. Добавление новых записей')
    print('3. Вычисления: средняя масса мальчиков, средний рост девочек, самый высокий ученик')
    print('4. Поиск записи по фамилии и имени')
    print('5. Удаление записи по фамилии и имени')
    print('6. Выход\n')
    
    num = input('Выберите пункт меню: ')
    while not num.isdigit() or int(num) not in range(1, 7):
        num = input('Повторите выбор пункта меню: ')
    return int(num)
